// 卡池gacha_type, 11: up, 12: 武器, 1: 常驻, 2: 新手
export const gachaType = ["11", "12", "1", "2"];
export const upGachaType = ["11", "12"];

// 常驻角色和武器
export const permanent = [
  ["姬子", "姬子"],
  ["瓦尔特", "瓦爾特"],
  ["布洛妮娅", "布洛妮婭"],
  ["杰帕德", "傑帕德"],
  ["克拉拉", "克拉拉"],
  ["彦卿", "彥卿"],
  ["白露", "白露"],
  ["银河铁道之夜", "銀河鐵道之夜"],
  ["无可取代的东西", "無可取代的東西"],
  ["但战斗还未结束", "但戰鬥還未結束"],
  ["以世界之名", "以世界之名"],
  ["制胜的瞬间", "制勝的瞬間"],
  ["如泥酣眠", "如泥酣眠"],
  ["时节不居", "時節不居"],
];

// 5~3星文本颜色
export const rankColor = ["#d2a96b", "#a256e0", "#387bc6"];

// 随机文本颜色
export const colors = [
  "#5470c6",
  "#fac858",
  "#ee6666",
  "#73c0de",
  "#3ba272",
  "#fc8452",
  "#9a60b4",
  "#ea7ccc",
  "#2ab7ca",
  "#005b96",
  "#ff8b94",
  "#72a007",
  "#b60d1b",
  "#16570d",
];
